# Assignment 1 -  Basic Data Preprocessing

In [4]:
import pandas as pd
import numpy as np 
import seaborn as sns 
import matplotlib.pyplot as plt

# Reading the csv file using Pandas and printing the first 5 values of the dataset

In [5]:
insurance = pd.read_csv(r'C:\Users\SRINIDHI\OneDrive\Desktop\ML\MLAssignments\Assignment 1\insurance.csv')
insurance.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

# Information about the dataset

In [6]:
insurance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

# Total null values in the dataset

In [7]:
insurance.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

# Statistics of the dataset

In [8]:
insurance.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

# Data types of the columns

In [9]:
insurance.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

# Shape of the data - rows and columns

In [10]:
insurance.shape

(1338, 7)

# Unique values in the data

In [11]:
insurance.nunique()

age           47
sex            2
bmi          548
children       6
smoker         2
region         4
charges     1337
dtype: int64

# Number of males and females

In [12]:
insurance['sex'].value_counts()

sex
male      676
female    662
Name: count, dtype: int64

# Number of non smokers and smokers

In [13]:
insurance['smoker'].value_counts()

smoker
no     1064
yes     274
Name: count, dtype: int64

# selecting the data

In [14]:
insurance.iloc[2:5]

   age   sex     bmi  children smoker     region      charges
2   28  male  33.000         3     no  southeast   4449.46200
3   33  male  22.705         0     no  northwest  21984.47061
4   32  male  28.880         0     no  northwest   3866.85520

In [15]:
insurance.iloc[0]

age                19
sex            female
bmi              27.9
children            0
smoker            yes
region      southwest
charges     16884.924
Name: 0, dtype: object

# sorting based on age

In [16]:
sort_ds = insurance.sort_values(by='age', ascending=True)
sort_ds.head()

      age     sex     bmi  children smoker     region       charges
57     18    male  31.680         2    yes  southeast  34303.167200
31     18  female  26.315         0     no  northeast   2198.189850
1023   18    male  23.320         1     no  southeast   1711.026800
427    18  female  29.165         0     no  northeast   7323.734819
1317   18    male  53.130         0     no  southeast   1163.462700

# converting variable data types

In [17]:
insurance['charges'] = insurance['charges'].astype('int32')
insurance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   int32
dtypes: float64(1), int32(1), int64(2), object(3)
memory usage: 68.1+ KB

In [18]:
insurance.head()

   age     sex     bmi  children smoker     region  charges
0   19  female  27.900         0    yes  southwest    16884
1   18    male  33.770         1     no  southeast     1725
2   28    male  33.000         3     no  southeast     4449
3   33    male  22.705         0     no  northwest    21984
4   32    male  28.880         0     no  northwest     3866

In [19]:
insurance['bmi'] = insurance['bmi'].astype('int64')
insurance.head()

   age     sex  bmi  children smoker     region  charges
0   19  female   27         0    yes  southwest    16884
1   18    male   33         1     no  southeast     1725
2   28    male   33         3     no  southeast     4449
3   33    male   22         0     no  northwest    21984
4   32    male   28         0     no  northwest     3866

# zero counts in the dataset

In [20]:
zero_count = (insurance == 0).sum().sum()
print(zero_count)

574